In [29]:
%load_ext sql
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
%sql mysql+pymysql://root:@localhost:3306/jupyter

In [24]:
%%sql
CREATE TABLE mammals_lifespan_kills (
    id INT AUTO_INCREMENT PRIMARY KEY,
    animal_name VARCHAR(100),
    lifespan_years INT,
    average_kills_per_year FLOAT
);

 * mysql+pymysql://root:***@localhost:3306/jupyter
0 rows affected.

[]

In [25]:
%%sql
INSERT INTO mammals_lifespan_kills (animal_name, lifespan_years, average_kills_per_year) 
VALUES
    ('Lion', 15, 200),
    ('Tiger', 20, 300),
    ('Wolf', 10, 150),
    ('Elephant', 60, 0),
    ('Human', 70, 0),
    ('Cheetah', 12, 120);

 * mysql+pymysql://root:***@localhost:3306/jupyter
6 rows affected.

[]

In [27]:
%config SqlMagic.displaycon = False  # Disable connection display
%config SqlMagic.feedback = False  # Disable feedback messages

In [34]:
import sqlalchemy
engine = sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/jupyter")
df = pd.read_sql("SELECT * FROM mammals_lifespan_kills", engine)
df

   id animal_name  lifespan_years  average_kills_per_year
0   1        Lion              15                   200.0
1   2       Tiger              20                   300.0
2   3        Wolf              10                   150.0
3   4    Elephant              60                     0.0
4   5       Human              70                     0.0
5   6     Cheetah              12                   120.0